export default {
    number: /^[0-9]*$/,
    chinese: /^[\u4e00-\u9fa5]{0,}$/,
    englishAndNum: /^[A-Za-z0-9]+$/,
    email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
    domainName: /[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\.?/,
    phone: /^((86)|(\+86))?(1)\d{2}(-)?\d{4}(-)?\d{4}$/,
    fixedPhone: /^(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}$/,
    iDNumber: /^((\d{18})|([0-9x]{18})|([0-9X]{18}))$/,
    // 字母开头，允许5-16字节，允许字母数字下划线
    account: /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/,
    // 以字母开头，长度在6~18之间，只能包含字母、数字和下划线
    password: /^[a-zA-Z]\w{5,17}$/,
    link: /(http|https):\/\/[\w\-_]+(\.[\w\-_]+)+([\w\-\.,@?^=%&amp;:/~\+#]*[\w\-\@?^=%&amp;/~\+#])?/,
    specialCharacters: /[\s'"()\[\]\{\}~`，。,;:]+/,
    emptyLine: /\n\s*\r/,
    ip: /((?:(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d)\\.){3}(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d))/,
    mailCode: /[1-9]\d{5}(?!\d)/
};